openwch/ch32v20x/EVT/EXAM/USB/USBD/MSC_CD-ROM/User/SW_CDROM.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : SW_CDROM.C
* Author             : WCH
* Version            : V1.0.1
* Date               : 2022/11/24
* Description        : CD-ROM Source File
*******************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/

/******************************************************************************/
/* Header Files */
#include <SPI_FLASH.h>
#include <SW_CDROM.h>
#include "usb_lib.h"
#include "ch32v20x_spi.h"
/******************************************************************************/
/* Variable Definition */
__attribute__ ((aligned(4))) uint8_t  CDROM_Pack_Buffer[DEF_CDROM_PACK_64];

/******************************************************************************/
/* INQUITY */
uint8_t CDROM_Inquity_Tab[ ] =
{
    0x05,                                                /* Peripheral Device CD-ROM = 0x05 */
    0x80,                                                /* Removable */
    0x02,                                                /* ISO/ECMA */
    0x02,
    0x1F,                                                /* Additional Length */
    0x00,                                                /* Reserved */
    0x00,                                                /* Reserved */
    0x00,                                                /* Reserved */
    'F',                                                 /* Vendor Information */
    'l',
    'a',
    's',
    'h',
    ' ',
    ' ',
    ' ',
    'U',
    'S',
    'B',
    ' ',
    'S',
    'p',
    'e',
    'c',
    'i',
    'a',
    'l',
    ' ',
    'D',
    'i',
    's',
    'k',
    '2',
    '.',
    'D',
    '0'
};

/******************************************************************************/
/* formatted capacity information */
uint8_t CDROM_Rd_Format_Capacity[ ] =
{
    0x00,
    0x00,
    0x00,
    0x08,
    ( MY_CDROM_SIZE >> 24 ) & 0xFF,
    ( MY_CDROM_SIZE >> 16 ) & 0xFF,
    ( MY_CDROM_SIZE >> 8 ) & 0xFF,
    ( MY_CDROM_SIZE ) & 0xFF,
    0x02,
    ( DEF_CFG_DISK_SEC_SIZE >> 16 ) & 0xFF,             /* Number of Blocks */
    ( DEF_CFG_DISK_SEC_SIZE >> 8 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE ) & 0xFF,
};

/******************************************************************************/
/* capacity information */
uint8_t CDROM_Rd_Capacity[ ] =
{
    ( ( MY_CDROM_SIZE - 1 ) >> 24 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 ) >> 16 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 ) >> 8 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 ) ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 24 ) & 0xFF,             /* Number of Blocks */
    ( DEF_CFG_DISK_SEC_SIZE >> 16 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 8 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE ) & 0xFF,
};

/******************************************************************************/
/* MODE_SENSE data,For CMD 0X1A */
uint8_t CDROM_Mode_Sense_1A[ ] =
{
    0x0B,
    0x00,
    0x00,                                               /* 0x00:write-unprotected,0x80:write-protected */
    0x08,
    ( ( MY_CDROM_SIZE - 1 ) >> 24 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  >> 16 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  >> 8 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 24 ) & 0xFF,             /* Number of Blocks */
    ( DEF_CFG_DISK_SEC_SIZE >> 16 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 8 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE ) & 0xFF,
};

/******************************************************************************/
/* MODE_SENSE data,For CMD 0X5A */
uint8_t CDROM_Mode_Senese_5A[ ] =
{
    0x00,
    0x0E,
    0x00,
    0x00,                                              /* 0x00:write-unprotected,0x80:write-protected */
    0x00,
    0x00,
    0x00,
    0x08,
    ( ( MY_CDROM_SIZE - 1 ) >> 24 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  >> 16 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  >> 8 ) & 0xFF,
    ( ( MY_CDROM_SIZE - 1 )  ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 24 ) & 0xFF,            /* Number of Blocks */
    ( DEF_CFG_DISK_SEC_SIZE >> 16 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE >> 8 ) & 0xFF,
    ( DEF_CFG_DISK_SEC_SIZE ) & 0xFF,
};


/* command response ->0x46 */
uint8_t CDROM_CMD46_Ret[ 136 ] =
{
    0x00, 0x00, 0x00, 0x84, 0x00, 0x00, 0x00, 0x0A, 0x00, 0x00, 0x03, 0x0C, 0x00, 0x08, 0x00, 0x00,
    0x00, 0x09, 0x00, 0x00, 0x00, 0x0A, 0x01, 0x00, 0x00, 0x01, 0x03, 0x04, 0x00, 0x00, 0x00, 0x02,
    0x00, 0x02, 0x03, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03, 0x03, 0x04, 0x2C, 0x00, 0x00, 0x00,
    0x00, 0x10, 0x01, 0x08, 0x00, 0x00, 0x08, 0x00, 0x00, 0x01, 0x01, 0x00, 0x00, 0x1D, 0x03, 0x00,
    0x00, 0x1E, 0x05, 0x04, 0x03, 0x00, 0x00, 0x00, 0x00, 0x21, 0x01, 0x08, 0x00, 0x00, 0x00, 0x01,
    0x07, 0x00, 0x00, 0x00, 0x00, 0x23, 0x01, 0x00, 0x00, 0x26, 0x00, 0x00, 0x00, 0x2D, 0x01, 0x04,
    0x17, 0x00, 0x00, 0x00, 0x00, 0x2E, 0x01, 0x04, 0x2F, 0x00, 0x20, 0x00, 0x01, 0x00, 0x03, 0x00,
    0x01, 0x03, 0x00, 0x04, 0x07, 0x00, 0x00, 0xFF, 0x01, 0x08, 0x03, 0x0C, 0x41, 0x41, 0x30, 0x31,
    0x20, 0x30, 0x30, 0x38, 0x31, 0x39, 0x37, 0x20
};

/* command response ->0x4A */
uint8_t CDROM_CMD4A_00_Ret[ 4 ] =
{
    /* Event Header Return Data */
    0x00, 0x02,                                                                 /* Event Data Length */
    0x04,                                                                       /* Returns Media Class events */
    0x10                                                                        /* support Media Status Class Events */
};

uint8_t CDROM_CMD4A_10_Ret[ 8 ] =
{
    0x00, 0x06,                                                                 /* Event Header Return Data */
    0x84,                                                                       /* NEA=1 */
    0x10,
    0x00, 0x00, 0x00, 0x00                                                      /* Media Event Descriptor */
};

/* command response ->0x43 */
uint8_t CDROM_CMD43_40_Ret[ 12 ] =
{
    0x00,
    0x0a,                                                                       /* number of bytes below */
    0x01,                                                                       /*first track */
    0x01,                                                                       /* last track */
    0x00,                                                                       /* reserved */
    0x14,                                                                       /* (adr, control) */
    0x01,                                                                       /* (track being described) */
    0x00,                                                                       /* (reserved) */
    0x00,
    (uint8_t)( ( MY_CDROM_SIZE - 1 ) >>16 ),
    (uint8_t)( ( MY_CDROM_SIZE - 1 ) >> 8 ),
    (uint8_t)( MY_CDROM_SIZE - 1 )                                              /* (start logical block address 0) */
};

uint8_t CDROM_CMD43_00_Ret[ 20 ] =
{
    0x00,
    0x12,                                                                       /* number of bytes below */
    0x01,                                                                       /* first track */
    0x01,                                                                       /* last track */

    0x00,                                                                       /* reserved */
    0x14,                                                                       /* (adr, control) */
    0x01,                                                                       /* (track being described) */
    0x00,                                                                       /* (reserved) */
    0x00,
    0x02,
    0x00,
    0x00,

