openwch/ch32v20x/EVT/EXAM/USB/USBD/MSC_CD-ROM/User/SW_CDROM.c
    0x00,
    0x14,
    0xaa,
    0x00,

    0x00,
    (uint8_t)( ( MY_CDROM_SIZE - 1 ) >> 16 ),
    (uint8_t)( ( MY_CDROM_SIZE - 1 ) >> 8 ),
    (uint8_t)( MY_CDROM_SIZE - 1 )                                           /* (start logical block address 0) */
};


const uint8_t CDROM_CMD43_80_Ret[ 48 ] =
{
    0x00, 0x2E, 0x01, 0x01, 0x01, 0x14, 0x00, 0xA0, 0x00, 0x00, 0x00, 0x00, 0x01, 0x20, 0x00, 0x01,
    0x14, 0x00, 0xA1, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x01, 0x14, 0x00, 0xA2, 0x00, 0x00,
    0x00, 0x00, 0x01, 0x2F, 0x3D, 0x01, 0x14, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00
};

/******************************************************************************/
/* command response ->0x51 */
const uint8_t CDROM_CMD51_Ret[ 28 ] =
{
    0x00, 0x20, 0x0e, 0x01, 0x01, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00
};

/******************************************************************************/
/* command response ->0x52 */
const uint8_t CDROM_CMD52_Ret[ 28 ] =
{
    0x00, 0x1A, 0x01, 0x01, 0x00, 0x04, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1F, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1F, 0x00
};

const uint8_t CDROM_CMD5A_2A_Ret[ 28 ] =
{
    0x00, 0x1a, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x2a, 0x12, 0x07, 0x07, 0x70, 0x00, 0x28, 0x00,
    0x56, 0xa0, 0x00, 0x00, 0x00, 0x00, 0x56, 0xa0, 0x00, 0x00, 0x00, 0x00
};


volatile uint8_t  CDROM_Status = 0x00;
volatile uint8_t  CDROM_Transfer_Status = 0x00; 
volatile uint32_t CDROM_Capability = 0x00; 
volatile uint8_t  CDROM_CBW_Tag_Save[ 4 ];
volatile uint8_t  CDROM_Sense_Key = 0x00;
volatile uint8_t  CDROM_Sense_ASC = 0x00;
volatile uint8_t  CDROM_CSW_Status = 0x00;

volatile uint32_t CDROM_Transfer_DataLen = 0x00;
volatile uint32_t CDROM_Cur_Sec_Lba = 0x00;
volatile uint16_t CDROM_Sec_Pack_Count = 0x00;
volatile uint16_t CDROM_Pack_Size = DEF_CDROM_PACK_64;

BULK_ONLY_CMD mBOC;
uint8_t   *pEndp2_Buf;


/*******************************************************************************
* Function Name  : CDROM_CMD_Deal_Ret_ErrorData
* Description    :
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void CDROM_CMD_Deal_Ret_ErrorData()
{
    uint16_t i;
    /* Upload 60 bytes of all 0 data */
    if( CDROM_Transfer_DataLen )
    {
        if( CDROM_Transfer_DataLen > 60 )
        {
            CDROM_Transfer_DataLen = 60;
        }
        for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
        {
            mBOC.buf[ i ] = 0x00;
        }
        pEndp2_Buf = mBOC.buf;
    }
}

/*******************************************************************************
* Function Name  : CDROM_CMD_Deal_Status
* Description    : Current command execution status
* Input          : key------Primary key for disk error details
*                  asc------Minor key for disk error details
*                  status---Current command execution result status
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_CMD_Deal_Status( uint8_t key, uint8_t asc, uint8_t status )
{
    CDROM_Sense_Key  = key;
    CDROM_Sense_ASC  = asc;
    CDROM_CSW_Status = status;
}

/*******************************************************************************
* Function Name  : CDROM_CMD_Deal_Fail
* Description    : The current command failed to execute
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_CMD_Deal_Fail( void )
{
    if( CDROM_Transfer_Status & DEF_CDROM_BLUCK_UP_FLAG )
    {
        /* EP2 -> STALL */
        SetEPTxStatus(ENDP2, EP_TX_STALL);
        CDROM_Transfer_Status &= ~DEF_CDROM_BLUCK_DOWN_FLAG;
    }
    if( CDROM_Transfer_Status & DEF_CDROM_BLUCK_DOWN_FLAG )
    {
        /* EP3 -> STALL */
        SetEPRxStatus(ENDP3, EP_RX_STALL);
        CDROM_Transfer_Status &= ~DEF_CDROM_BLUCK_DOWN_FLAG;
    }
}

/*******************************************************************************
* Function Name  : CMD_RD_WR_Deal_Pre
* Description    : Preparation before read and write sector processing
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CMD_RD_WR_Deal_Pre( void )
{
    /* Save the sector number to be operated currently */
    CDROM_Cur_Sec_Lba = (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 2 ] << 24;
    CDROM_Cur_Sec_Lba = CDROM_Cur_Sec_Lba + ( (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 3 ] << 16 );
    CDROM_Cur_Sec_Lba = CDROM_Cur_Sec_Lba + ( (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 4 ] << 8 );
    CDROM_Cur_Sec_Lba = CDROM_Cur_Sec_Lba + ( (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 5 ] );
        
    /* Save the current length of data to be manipulated */                    
    CDROM_Transfer_DataLen = ( (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 7 ] << 8 );
    CDROM_Transfer_DataLen = CDROM_Transfer_DataLen + ( (uint32_t)mBOC.mCBW.mCBW_CB_Buf[ 8 ] );
    CDROM_Transfer_DataLen = CDROM_Transfer_DataLen * DEF_CDROM_SECTOR_SIZE;         

    /* Clear related variables */
    CDROM_Sec_Pack_Count = 0x00;
    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
}

/*******************************************************************************
* Function Name  : CDROM_SCSI_CMD_Deal
* Description    : dealing SCSI command
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_SCSI_CMD_Deal( void )
{
    uint8_t i;

    if( ( mBOC.mCBW.mCBW_Sig[ 0 ] == 'U' ) && ( mBOC.mCBW.mCBW_Sig[ 1 ] == 'S' ) 
      &&( mBOC.mCBW.mCBW_Sig[ 2 ] == 'B' ) && ( mBOC.mCBW.mCBW_Sig[ 3 ] == 'C' ) )
    {
        CDROM_CBW_Tag_Save[ 0 ] = mBOC.mCBW.mCBW_Tag[ 0 ];
        CDROM_CBW_Tag_Save[ 1 ] = mBOC.mCBW.mCBW_Tag[ 1 ];
        CDROM_CBW_Tag_Save[ 2 ] = mBOC.mCBW.mCBW_Tag[ 2 ];
        CDROM_CBW_Tag_Save[ 3 ] = mBOC.mCBW.mCBW_Tag[ 3 ];

        CDROM_Transfer_DataLen = ( uint32_t )mBOC.mCBW.mCBW_DataLen[ 3 ] << 24;
        CDROM_Transfer_DataLen += ( ( uint32_t )mBOC.mCBW.mCBW_DataLen[ 2 ] << 16 );
        CDROM_Transfer_DataLen += ( ( uint32_t )mBOC.mCBW.mCBW_DataLen[ 1 ] << 8 );
        CDROM_Transfer_DataLen += ( ( uint32_t )mBOC.mCBW.mCBW_DataLen[ 0 ] );
        
        if( CDROM_Transfer_DataLen )                                     
        {
            if( mBOC.mCBW.mCBW_Flag & 0x80 )
            {
                CDROM_Transfer_Status |= DEF_CDROM_BLUCK_UP_FLAG;
            }    
            else
            {    
                CDROM_Transfer_Status |= DEF_CDROM_BLUCK_DOWN_FLAG;
            }
        }
        CDROM_Transfer_Status |= DEF_CDROM_CSW_UP_FLAG;

        /* SCSI command packet processing */ 
        switch( mBOC.mCBW.mCBW_CB_Buf[ 0 ] )
        {
            case  CMD_U_INQUIRY:                                                                    
                /* CMD: 0x12 */
                if( CDROM_Transfer_DataLen > 0x24 )
                {
                    CDROM_Transfer_DataLen = 0x24;
                }    

