openwch/ch32v20x/EVT/EXAM/USB/USBD/MSC_CD-ROM/User/SW_CDROM.c
                /* Add upload FLASH chip ID number */
                CDROM_Inquity_Tab[ 32 ] =  (uint8_t)( Flash_ID >> 24 );
                CDROM_Inquity_Tab[ 33 ] =  (uint8_t)( Flash_ID >> 16 );
                CDROM_Inquity_Tab[ 34 ] =  (uint8_t)( Flash_ID >> 8 );
                CDROM_Inquity_Tab[ 35 ] =  (uint8_t)( Flash_ID );

                /* CD-ROM Mode */
                CDROM_Inquity_Tab[ 0 ] = 0x05;
                pEndp2_Buf = (uint8_t *)CDROM_Inquity_Tab;
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                break;
    
            case  CMD_U_READ_FORMAT_CAPACITY:                                     
                /* CMD: 0x23 */
                if( ( CDROM_Status & DEF_CDROM_EN_FLAG ) )
                {    
                    if( CDROM_Transfer_DataLen > 0x0C )
                    {
                        CDROM_Transfer_DataLen = 0x0C; 
                    }    
                                    
                    for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
                    {
                        mBOC.buf[ i ] = CDROM_Rd_Format_Capacity[ i ];
                    } 
                    mBOC.buf[ 4 ] = ( ( CDROM_Capability >> 24 ) & 0xFF );
                    mBOC.buf[ 5 ] = ( ( CDROM_Capability >> 16 ) & 0xFF );
                    mBOC.buf[ 6 ] = ( ( CDROM_Capability >> 8  ) & 0xFF );
                    mBOC.buf[ 7 ] = ( ( CDROM_Capability       ) & 0xFF );
                    pEndp2_Buf = mBOC.buf;   
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 );
                    CDROM_CMD_Deal_Fail( );
                }    
                break;

            case  CMD_U_READ_CAPACITY:                                              
                /* CMD: 0x25 */
                if( ( CDROM_Status & DEF_CDROM_EN_FLAG ) )  
                {    
                    if( CDROM_Transfer_DataLen > 0x08 )
                    {
                        CDROM_Transfer_DataLen = 0x08;
                    }    
                                                
                    for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
                    {
                        mBOC.buf[ i ] = CDROM_Rd_Capacity[ i ];    
                    } 
                    mBOC.buf[ 0 ] = ( ( CDROM_Capability - 1 ) >> 24 ) & 0xFF;
                    mBOC.buf[ 1 ] = ( ( CDROM_Capability - 1 ) >> 16 ) & 0xFF;
                    mBOC.buf[ 2 ] = ( ( CDROM_Capability - 1 ) >> 8  ) & 0xFF;
                    mBOC.buf[ 3 ] = ( ( CDROM_Capability - 1 )       ) & 0xFF;

                    pEndp2_Buf = mBOC.buf;     
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 ); 
                    CDROM_CMD_Deal_Fail( ); 
                }    
                break;

            case  CMD_U_READ10:                                                     
                /* CMD: 0x28 */
                if( ( CDROM_Status & DEF_CDROM_EN_FLAG ) )
                {                    
                    CMD_RD_WR_Deal_Pre( );
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 );
                    CDROM_CMD_Deal_Fail( );
                }    
                break;
    
            case  CMD_U_WR_VERIFY10:                                             
                /* CMD: 0x2E */
            case  CMD_U_WRITE10:                                                
                /* CMD: 0x2A */
                if( CDROM_Status & DEF_CDROM_EN_FLAG )
                {        
                    CMD_RD_WR_Deal_Pre( );
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 );
                    CDROM_CMD_Deal_Fail( );
                }                
                break;
    
            case  CMD_U_MODE_SENSE:                                                 
                /* CMD: 0x1A */
                if( ( CDROM_Status & DEF_CDROM_EN_FLAG ) )
                {    
                    if( CDROM_Transfer_DataLen > 0x0C )
                    {
                        CDROM_Transfer_DataLen = 0x0C;
                    }
                    for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
                    {
                        mBOC.buf[ i ] = CDROM_Mode_Sense_1A[ i ];    
                    } 
                    mBOC.buf[ 4 ] = ( CDROM_Capability >> 24 ) & 0xFF;
                    mBOC.buf[ 5 ] = ( CDROM_Capability >> 16 ) & 0xFF;
                    mBOC.buf[ 6 ] = ( CDROM_Capability >> 8  ) & 0xFF;
                    mBOC.buf[ 7 ] = ( CDROM_Capability       ) & 0xFF;
                    pEndp2_Buf = mBOC.buf;                
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 );
                    CDROM_CMD_Deal_Fail( );
                }
                break;

            case  CMD_U_MODE_SENSE2:                                             
                /* CMD: 0x5A */
                if( mBOC.mCBW.mCBW_CB_Buf[ 2 ] == 0x3F )
                {    
                    if( CDROM_Transfer_DataLen > 0x10 )
                    {
                        CDROM_Transfer_DataLen = 0x10;
                    }

                    for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
                    {
                        mBOC.buf[ i ] = CDROM_Mode_Senese_5A[ i ];    
                    } 
                    mBOC.buf[ 8 ]  = ( CDROM_Capability >> 24 ) & 0xFF;
                    mBOC.buf[ 9 ]  = ( CDROM_Capability >> 16 ) & 0xFF;
                    mBOC.buf[ 10 ] = ( CDROM_Capability >> 8  ) & 0xFF;
                    mBOC.buf[ 11 ] = ( CDROM_Capability       ) & 0xFF;
                    pEndp2_Buf = mBOC.buf;         
                }
                else if (mBOC.mCBW.mCBW_CB_Buf[ 2 ] == 0x2A)
				{
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD5A_2A_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD5A_2A_Ret );
                    }
                    for( i = 0x00; i < CDROM_Transfer_DataLen; i++ )
                    {
                        mBOC.buf[ i ] = CDROM_CMD5A_2A_Ret[ i ];
                    }
                    pEndp2_Buf = mBOC.buf;
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x05, 0x20, 0x01 );
                    CDROM_CMD_Deal_Fail( );
                }
                break;
    
