openwch/ch32v20x/EVT/EXAM/USB/USBD/MSC_CD-ROM/User/SW_CDROM.c
            case  CMD_U_REQUEST_SENSE:                                              
                /* CMD: 0x03 */
                mBOC.ReqSense.ErrorCode = 0x70;
                mBOC.ReqSense.Reserved1 = 0x00;
                mBOC.ReqSense.SenseKey  = CDROM_Sense_Key;
                mBOC.ReqSense.Information[ 0 ] = 0x00;
                mBOC.ReqSense.Information[ 1 ] = 0x00;
                mBOC.ReqSense.Information[ 2 ] = 0x00;
                mBOC.ReqSense.Information[ 3 ] = 0x00;
                mBOC.ReqSense.SenseLength = 0x0A;
                mBOC.ReqSense.Reserved2[ 0 ] = 0x00;
                mBOC.ReqSense.Reserved2[ 1 ] = 0x00;
                mBOC.ReqSense.Reserved2[ 2 ] = 0x00;
                mBOC.ReqSense.Reserved2[ 3 ] = 0x00;
                mBOC.ReqSense.SenseCode = CDROM_Sense_ASC;
                mBOC.ReqSense.SenseCodeQua = 0x00;
                mBOC.ReqSense.Reserved3[ 0 ] = 0x00;
                mBOC.ReqSense.Reserved3[ 1 ] = 0x00;
                mBOC.ReqSense.Reserved3[ 2 ] = 0x00;
                mBOC.ReqSense.Reserved3[ 3 ] = 0x00;
                pEndp2_Buf = mBOC.buf;
                CDROM_CSW_Status = 0x00;
                break;
            case  CMD_U_TEST_READY:       
                if( CDROM_Status & DEF_CDROM_EN_FLAG )
                {    
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                }
                else
                {
                    CDROM_CMD_Deal_Status( 0x02, 0x3A, 0x01 ); 
                    CDROM_Transfer_Status |= DEF_CDROM_BLUCK_UP_FLAG;   
                    CDROM_CMD_Deal_Fail( ); 
                }
                break;
    
            case  CMD_U_PREVT_REMOVE:                                             
                /* CMD: 0x1E */
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                break;
    
            case  CMD_U_VERIFY10:                                                  
                /* CMD: 0x1F */
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                break;
                
            case  CMD_U_START_STOP:                                                  
                /* CMD: 0x1B */
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );
                break;

			case 0x46:
                if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD46_Ret ) )
                {
                    CDROM_Transfer_DataLen = sizeof( CDROM_CMD46_Ret );
                }
                pEndp2_Buf = (uint8_t *)CDROM_CMD46_Ret;
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                      /* Disk command executed successfully */
                break;

            case 0x4A:
                if( mBOC.mCBW.mCBW_CB_Buf[ 4 ] == 0x00 )
                {
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD4A_00_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD4A_00_Ret );
                    }
                    pEndp2_Buf = (uint8_t *)CDROM_CMD4A_00_Ret;
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                  /* Disk command executed successfully */
                }
                else if( mBOC.mCBW.mCBW_CB_Buf[ 4 ] == 0x10 )
                {
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD4A_10_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD4A_10_Ret );
                    }
                    pEndp2_Buf = (uint8_t *)CDROM_CMD4A_10_Ret;
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                  /* Disk command executed successfully */
                }
                else
                {
                    CDROM_CMD_Deal_Ret_ErrorData( );                            /* return invalid data */
                    CDROM_CMD_Deal_Status( 0x05, 0x20, 0x01 );                  /* report parameter error */
                    CDROM_CMD_Deal_Fail( );                                     /* Disk command execution failed */
                }
                break;

            case 0x43:
                if( mBOC.mCBW.mCBW_CB_Buf[ 9 ] == 0x40 )
                {
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD43_40_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD43_40_Ret );
                    }

                    CDROM_CMD43_40_Ret[9] = (uint8_t)( ( CDROM_Capability - 1) >>16 );
                    CDROM_CMD43_40_Ret[10] = (uint8_t)( ( CDROM_Capability - 1 ) >>8 );
                    CDROM_CMD43_40_Ret[11] = (uint8_t)( CDROM_Capability - 1);
                    pEndp2_Buf = (uint8_t *)CDROM_CMD43_40_Ret;
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                  /* Disk command executed successfully */
                }
                else if( mBOC.mCBW.mCBW_CB_Buf[ 9 ] == 0x00 )
                {
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD43_00_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD43_00_Ret );
                    }
                    CDROM_CMD43_00_Ret[17] = (uint8_t)( ( CDROM_Capability - 1) >>16 );
                    CDROM_CMD43_00_Ret[18] = (uint8_t)( ( CDROM_Capability - 1) >>8 );
                    CDROM_CMD43_00_Ret[19] = (uint8_t)( CDROM_Capability - 1);
                    pEndp2_Buf = (uint8_t *)CDROM_CMD43_00_Ret;
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                  /* Disk command executed successfully */
                }
                else if( mBOC.mCBW.mCBW_CB_Buf[ 9 ] == 0x80 )
                {
                    if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD43_80_Ret ) )
                    {
                        CDROM_Transfer_DataLen = sizeof( CDROM_CMD43_80_Ret );
                    }
                    pEndp2_Buf = (uint8_t *)CDROM_CMD43_80_Ret;
                    CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                  /* Disk command executed successfully */
                }
                else
                {
                    CDROM_CMD_Deal_Ret_ErrorData( );                            /* return invalid data */
                    CDROM_CMD_Deal_Status( 0x05, 0x20, 0x01 );                  /* report parameter error */
                    CDROM_CMD_Deal_Fail( );                                     /* Disk command execution failed */
                }
                break;

            case 0xBB:
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                      /* Disk command executed successfully */
                break;

            case 0x51:
                if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD51_Ret ) )
                {
                    CDROM_Transfer_DataLen = sizeof( CDROM_CMD51_Ret );
                }
                pEndp2_Buf = (uint8_t *)CDROM_CMD51_Ret;
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                      /* Disk command executed successfully */
                break;

