openwch/ch32v20x/EVT/EXAM/USB/USBD/MSC_CD-ROM/User/SW_CDROM.c
            case 0x52:
                if( CDROM_Transfer_DataLen > sizeof( CDROM_CMD52_Ret ) )
                {
                    CDROM_Transfer_DataLen = sizeof( CDROM_CMD52_Ret );
                }
                pEndp2_Buf = (uint8_t *)CDROM_CMD52_Ret;
                CDROM_CMD_Deal_Status( 0x00, 0x00, 0x00 );                      /* Disk command executed successfully */
                break;

            case 0xAC:
            case 0x85:
                CDROM_CMD_Deal_Ret_ErrorData( );
                CDROM_CMD_Deal_Status( 0x05, 0x20, 0x01 );                      /* report parameter error */
                break;

            default:
                CDROM_CMD_Deal_Status( 0x05, 0x20, 0x01 );
                CDROM_Transfer_Status |= DEF_CDROM_BLUCK_UP_FLAG; 
                CDROM_CMD_Deal_Fail( );
                break;
        }
    }    
    else                                                                         
    {   /* Bad package flag for CBW package */
        CDROM_CMD_Deal_Status( 0x05, 0x20, 0x02 );
        CDROM_Transfer_Status |= DEF_CDROM_BLUCK_UP_FLAG;
        CDROM_Transfer_Status |= DEF_CDROM_BLUCK_DOWN_FLAG;
        CDROM_CMD_Deal_Fail(  );
    }
}

/*******************************************************************************
* Function Name  : CDROM_In_EP_Deal
* Description    : Upload endpoint handling
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_In_EP_Deal( void )
{        
    if( CDROM_Transfer_Status & DEF_CDROM_BLUCK_UP_FLAG ) 
    {
        if( mBOC.mCBW.mCBW_CB_Buf[ 0 ] == CMD_U_READ10 )
        {
            CDROM_Up_OnePack( );
        }
        else
        {
            CDROM_Bulk_UpData( );
        }
    }
    else if( CDROM_Transfer_Status & DEF_CDROM_CSW_UP_FLAG )
    {    
        CDROM_Up_CSW( );
    }
}

/*******************************************************************************
* Function Name  : CDROM_Out_EP_Deal
* Description    : Download endpoint processing
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_Out_EP_Deal( uint8_t *pbuf, uint16_t packlen )
{
    uint32_t i;
    /* Endpoint 2 download data processing */
    if( CDROM_Transfer_Status & DEF_CDROM_BLUCK_DOWN_FLAG )
    {
        CDROM_Down_OnePack( pbuf, packlen );
    }
    else
    {                                
        if( packlen == 0x1F )
        {
            for( i = 0; i < packlen; i++ ) 
            {
                mBOC.buf[ i ] = *pbuf++;
            }
            CDROM_SCSI_CMD_Deal( );
            if( ( CDROM_Transfer_Status & DEF_CDROM_BLUCK_DOWN_FLAG ) == 0x00 )
            {
                if( CDROM_Transfer_Status & DEF_CDROM_BLUCK_UP_FLAG )
                {
                    if( mBOC.mCBW.mCBW_CB_Buf[ 0 ] == CMD_U_READ10 )
                    {
                        CDROM_Up_OnePack( );
                    }
                    else
                    {
                        CDROM_Bulk_UpData( );
                    }
                }
                else if( CDROM_CSW_Status == 0x00 )
                {
                    /* upload CSW */
                    CDROM_Up_CSW(  );                     
                }                        
            }
        }
    }
}

/*******************************************************************************
* Function Name  : CDROM_Bulk_UpData
* Description    : EP2 upload data
* Input          : Transfer_DataLen--- length of data transferred
*                  *pBuf---data address pointer
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_Bulk_UpData( void )
{                                            
    uint32_t  len;

    if( CDROM_Transfer_DataLen > CDROM_Pack_Size )
    {
        len = CDROM_Pack_Size;
        CDROM_Transfer_DataLen -= CDROM_Pack_Size;
    }
    else
    {
        len = CDROM_Transfer_DataLen;
        CDROM_Transfer_DataLen = 0x00;
        CDROM_Transfer_Status &= ~DEF_CDROM_BLUCK_UP_FLAG;        
    }

    /* Load the data into the upload buffer and start the upload */
    USB_SIL_Write( EP2_IN, pEndp2_Buf, len );
    SetEPTxStatus( ENDP2, EP_TX_VALID );
}

/*******************************************************************************
* Function Name  : CDROM_Up_CSW
* Description    : Bulk endpoint endpoint 2 upload CSW package
* Input          : CBW_Tag_Save---command block label
*                  CSW_Status---Current command execution result status
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_Up_CSW( void )
{
    CDROM_Transfer_Status = 0x00;

    mBOC.mCSW.mCSW_Sig[ 0 ] = 'U';
    mBOC.mCSW.mCSW_Sig[ 1 ] = 'S';
    mBOC.mCSW.mCSW_Sig[ 2 ] = 'B';
    mBOC.mCSW.mCSW_Sig[ 3 ] = 'S';
    mBOC.mCSW.mCSW_Tag[ 0 ] = CDROM_CBW_Tag_Save[ 0 ];
    mBOC.mCSW.mCSW_Tag[ 1 ] = CDROM_CBW_Tag_Save[ 1 ];
    mBOC.mCSW.mCSW_Tag[ 2 ] = CDROM_CBW_Tag_Save[ 2 ];
    mBOC.mCSW.mCSW_Tag[ 3 ] = CDROM_CBW_Tag_Save[ 3 ];
    mBOC.mCSW.mCSW_Residue[ 0 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 1 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 2 ] = 0x00;
    mBOC.mCSW.mCSW_Residue[ 3 ] = 0x00;
    mBOC.mCSW.mCSW_Status = CDROM_CSW_Status;

    /* Load the data into the upload buffer and start the upload */
    USB_SIL_Write( EP2_IN, (uint8_t *)mBOC.buf, 0x0D );
    SetEPTxStatus( ENDP2, EP_TX_VALID );
}

/*******************************************************************************
* Function Name  : CDROM_Up_OnePack
* Description    : CD-ROM upload a pack
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_Up_OnePack( void )
{    
    uint8_t *pbuf = NULL;

    if( CDROM_Sec_Pack_Count == 0x00 )     
    {
        FLASH_RD_Block_Start( CDROM_Cur_Sec_Lba * DEF_CDROM_SECTOR_SIZE );
    }
    FLASH_RD_Block( CDROM_Pack_Buffer, CDROM_Pack_Size );
    pbuf = CDROM_Pack_Buffer;

    /* USB upload this package data */
    USB_SIL_Write( EP2_IN, pbuf, CDROM_Pack_Size );
    SetEPTxStatus( ENDP2, EP_TX_VALID );

    /* Determine whether the current sector data is read and uploaded */
    CDROM_Sec_Pack_Count++;
    CDROM_Transfer_DataLen -= CDROM_Pack_Size;

    if( CDROM_Sec_Pack_Count == ( DEF_CDROM_SECTOR_SIZE / CDROM_Pack_Size ) )
    {
        PIN_FLASH_CS_HIGH( );
        CDROM_Sec_Pack_Count = 0x00;
        CDROM_Cur_Sec_Lba++;
    }
    /* Determine whether the current sector data is read and uploaded */    
     if( CDROM_Transfer_DataLen == 0x00 )
    {    
        CDROM_Transfer_Status &= ~DEF_CDROM_BLUCK_UP_FLAG;
    }
}

/*******************************************************************************
* Function Name  : CDROM_Down_OnePack
* Description    : Do nothing, cause CD-ROM Mode is read-only.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CDROM_Down_OnePack( uint8_t *pbuf, uint16_t packlen )
{
    // CD-ROM Mode is read-only
    return;
}
